<?xml version="1.0" ?>
<net name="yolo-fastestv2" version="10">
	<layers>
		<layer id="0" name="input.1" type="Parameter" version="opset1">
			<data shape="1, 3, 352, 352" element_type="f32"/>
			<output>
				<port id="0" precision="FP32" names="input.1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="784" type="Const" version="opset1">
			<data element_type="f32" shape="24, 3, 3, 3" offset="0" size="2592"/>
			<output>
				<port id="0" precision="FP32" names="784">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Conv_0/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>352</dim>
					<dim>352</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Conv_0/Dims4547" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="2592" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Conv_0" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="783">
					<dim>1</dim>
					<dim>24</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Relu_1" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="447">
					<dim>1</dim>
					<dim>24</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="MaxPool_2" type="MaxPool" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" kernel="3, 3" rounding_type="floor" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>176</dim>
					<dim>176</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="448">
					<dim>1</dim>
					<dim>24</dim>
					<dim>88</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="787" type="Const" version="opset1">
			<data element_type="f32" shape="24, 1, 1, 3, 3" offset="2688" size="864"/>
			<output>
				<port id="0" precision="FP32" names="787">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Conv_3/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>88</dim>
					<dim>88</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Conv_3/Dims4967" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="3552" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Conv_3" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="786">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="790" type="Const" version="opset1">
			<data element_type="f32" shape="24, 24, 1, 1" offset="3648" size="2304"/>
			<output>
				<port id="0" precision="FP32" names="790">
					<dim>24</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Conv_4/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Conv_4/Dims4865" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="5952" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Conv_4" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="789">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Relu_5" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="453">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="793" type="Const" version="opset1">
			<data element_type="f32" shape="24, 24, 1, 1" offset="6048" size="2304"/>
			<output>
				<port id="0" precision="FP32" names="793">
					<dim>24</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Conv_6/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>88</dim>
					<dim>88</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>88</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Conv_6/Dims4943" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="8352" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Conv_6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>88</dim>
					<dim>88</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="792">
					<dim>1</dim>
					<dim>24</dim>
					<dim>88</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Relu_7" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>88</dim>
					<dim>88</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="456">
					<dim>1</dim>
					<dim>24</dim>
					<dim>88</dim>
					<dim>88</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="796" type="Const" version="opset1">
			<data element_type="f32" shape="24, 1, 1, 3, 3" offset="8448" size="864"/>
			<output>
				<port id="0" precision="FP32" names="796">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Conv_8/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>88</dim>
					<dim>88</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv_8/Dims4559" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="9312" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Conv_8" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="795">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="799" type="Const" version="opset1">
			<data element_type="f32" shape="24, 24, 1, 1" offset="9408" size="2304"/>
			<output>
				<port id="0" precision="FP32" names="799">
					<dim>24</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Conv_9/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Conv_9/Dims4889" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="11712" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Conv_9" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="798">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Relu_10" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="461">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Concat_11" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="462">
					<dim>1</dim>
					<dim>48</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_12" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="11808" size="24"/>
			<output>
				<port id="0" precision="I64" names="463">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Reshape_13" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="464">
					<dim>24</dim>
					<dim>2</dim>
					<dim>1936</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="440" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="11832" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Transpose_14" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>24</dim>
					<dim>2</dim>
					<dim>1936</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="465">
					<dim>2</dim>
					<dim>24</dim>
					<dim>1936</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_15" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="11856" size="40"/>
			<output>
				<port id="0" precision="I64" names="466">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Reshape_16" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>24</dim>
					<dim>1936</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="467">
					<dim>2</dim>
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Constant_17" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="11896" size="4"/>
			<output>
				<port id="0" precision="I32" names="468"/>
			</output>
		</layer>
		<layer id="38" name="Gather_18/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="11900" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="39" name="Gather_18457" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="FP32" names="469">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Constant_19" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="11908" size="4"/>
			<output>
				<port id="0" precision="I32" names="470"/>
			</output>
		</layer>
		<layer id="41" name="Gather_20/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="11900" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="42" name="Gather_20453" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="FP32" names="471">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="802" type="Const" version="opset1">
			<data element_type="f32" shape="24, 24, 1, 1" offset="11912" size="2304"/>
			<output>
				<port id="0" precision="FP32" names="802">
					<dim>24</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Conv_21/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Conv_21/Dims4655" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="14216" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Conv_21" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="801">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Relu_22" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="474">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="805" type="Const" version="opset1">
			<data element_type="f32" shape="24, 1, 1, 3, 3" offset="14312" size="864"/>
			<output>
				<port id="0" precision="FP32" names="805">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv_23/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv_23/Dims4991" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="15176" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_23" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="804">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="808" type="Const" version="opset1">
			<data element_type="f32" shape="24, 24, 1, 1" offset="15272" size="2304"/>
			<output>
				<port id="0" precision="FP32" names="808">
					<dim>24</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Conv_24/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Conv_24/Dims4925" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="17576" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv_24" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="807">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Relu_25" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="479">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Concat_26" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="480">
					<dim>1</dim>
					<dim>48</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_27" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="11808" size="24"/>
			<output>
				<port id="0" precision="I64" names="481">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Reshape_28" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="482">
					<dim>24</dim>
					<dim>2</dim>
					<dim>1936</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="431" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="11832" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Transpose_29" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>24</dim>
					<dim>2</dim>
					<dim>1936</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="483">
					<dim>2</dim>
					<dim>24</dim>
					<dim>1936</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_30" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="11856" size="40"/>
			<output>
				<port id="0" precision="I64" names="484">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Reshape_31" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>24</dim>
					<dim>1936</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="485">
					<dim>2</dim>
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_32" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="11896" size="4"/>
			<output>
				<port id="0" precision="I32" names="486"/>
			</output>
		</layer>
		<layer id="65" name="Gather_33/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="11900" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="66" name="Gather_33469" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="FP32" names="487">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Constant_34" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="11908" size="4"/>
			<output>
				<port id="0" precision="I32" names="488"/>
			</output>
		</layer>
		<layer id="68" name="Gather_35/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="11900" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="69" name="Gather_35447" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="FP32" names="489">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="811" type="Const" version="opset1">
			<data element_type="f32" shape="24, 24, 1, 1" offset="17672" size="2304"/>
			<output>
				<port id="0" precision="FP32" names="811">
					<dim>24</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Conv_36/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Conv_36/Dims4769" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="19976" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv_36" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="810">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Relu_37" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="492">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="814" type="Const" version="opset1">
			<data element_type="f32" shape="24, 1, 1, 3, 3" offset="20072" size="864"/>
			<output>
				<port id="0" precision="FP32" names="814">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Conv_38/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Conv_38/Dims4643" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="20936" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Conv_38" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="813">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="817" type="Const" version="opset1">
			<data element_type="f32" shape="24, 24, 1, 1" offset="21032" size="2304"/>
			<output>
				<port id="0" precision="FP32" names="817">
					<dim>24</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv_39/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv_39/Dims4955" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="23336" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Conv_39" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="816">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Relu_40" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="497">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Concat_41" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="498">
					<dim>1</dim>
					<dim>48</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_42" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="11808" size="24"/>
			<output>
				<port id="0" precision="I64" names="499">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Reshape_43" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="500">
					<dim>24</dim>
					<dim>2</dim>
					<dim>1936</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="436" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="11832" size="24"/>
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Transpose_44" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>24</dim>
					<dim>2</dim>
					<dim>1936</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="501">
					<dim>2</dim>
					<dim>24</dim>
					<dim>1936</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Constant_45" type="Const" version="opset1">
			<data element_type="i64" shape="5" offset="11856" size="40"/>
			<output>
				<port id="0" precision="I64" names="502">
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Reshape_46" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>24</dim>
					<dim>1936</dim>
				</port>
				<port id="1" precision="I64">
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="503">
					<dim>2</dim>
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_47" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="11896" size="4"/>
			<output>
				<port id="0" precision="I32" names="504"/>
			</output>
		</layer>
		<layer id="92" name="Gather_48/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="11900" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="93" name="Gather_48461" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="FP32" names="505">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_49" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="11908" size="4"/>
			<output>
				<port id="0" precision="I32" names="506"/>
			</output>
		</layer>
		<layer id="95" name="Gather_50/axis" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="11900" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="96" name="Gather_50455" type="Gather" version="opset7">
			<data batch_dims="0"/>
			<input>
				<port id="0" precision="FP32">
					<dim>2</dim>
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="I32"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="FP32" names="507">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="820" type="Const" version="opset1">
			<data element_type="f32" shape="24, 24, 1, 1" offset="23432" size="2304"/>
			<output>
				<port id="0" precision="FP32" names="820">
					<dim>24</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Conv_51/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Conv_51/Dims4979" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="25736" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Conv_51" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="819">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Relu_52" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="510">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="823" type="Const" version="opset1">
			<data element_type="f32" shape="24, 1, 1, 3, 3" offset="25832" size="864"/>
			<output>
				<port id="0" precision="FP32" names="823">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Conv_53/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Conv_53/Dims4739" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="26696" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Conv_53" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="822">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="826" type="Const" version="opset1">
			<data element_type="f32" shape="24, 24, 1, 1" offset="26792" size="2304"/>
			<output>
				<port id="0" precision="FP32" names="826">
					<dim>24</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Conv_54/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>24</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Conv_54/Dims4619" type="Const" version="opset1">
			<data element_type="f32" shape="1, 24, 1, 1" offset="29096" size="96"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv_54" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="825">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Relu_55" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="515">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Concat_56" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>24</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="516">
					<dim>1</dim>
					<dim>48</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="829" type="Const" version="opset1">
			<data element_type="f32" shape="48, 1, 1, 3, 3" offset="29192" size="1728"/>
			<output>
				<port id="0" precision="FP32" names="829">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Conv_57/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>22</dim>
					<dim>22</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Conv_57/Dims4829" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="30920" size="192"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Conv_57" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>22</dim>
					<dim>22</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="828">
					<dim>1</dim>
					<dim>48</dim>
					<dim>22</dim>
					<dim>22</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="832" type="Const" version="opset1">
			<data element_type="f32" shape="48, 48, 1, 1" offset="31112" size="9216"/>
			<output>
				<port id="0" precision="FP32" names="832">
					<dim>48</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Conv_58/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>22</dim>
					<dim>22</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>22</dim>
					<dim>22</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Conv_58/Dims4841" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="40328" size="192"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Conv_58" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>22</dim>
					<dim>22</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="831">
					<dim>1</dim>
					<dim>48</dim>
					<dim>22</dim>
					<dim>22</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Relu_59" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>22</dim>
					<dim>22</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="521">
					<dim>1</dim>
					<dim>48</dim>
					<dim>22</dim>
					<dim>22</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="835" type="Const" version="opset1">
			<data element_type="f32" shape="48, 48, 1, 1" offset="40520" size="9216"/>
			<output>
				<port id="0" precision="FP32" names="835">
					<dim>48</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Conv_60/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit"/>
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>44</dim>
					<dim>44</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Conv_60/Dims4751" type="Const" version="opset1">
			<data element_type="f32" shape="1, 48, 1, 1" offset="49736" size="192"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Conv_60" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
